app/Controllers/Building.php

SELECT `Buildings`.*
FROM `Buildings`
WHERE `Buildings`.`building_id` = '4'
 LIMIT 1
---
    public function add(){
        $buildingId = $this->request->getUri()->getSegment(3);
        // echo $userid;
        $buildingModel = new BuildingModel();
        $building = $buildingModel->select('Buildings.*')
                        ->first();