app/Controllers/Facility.php

    public function index()
    {
        $session = session();
        if (!$session->get('login')) {
            return redirect()->to('/login');
        }
        $facilityModel = new FacilityModel();
        $availableCount = $facilityModel->where('status', 'available')->countAllResults();
        $maintenanceCount = $facilityModel->where('status', 'maintenance')->countAllResults();
        $totalCount = $facilityModel->countAll();
---
SELECT COUNT(*) AS `numrows`
FROM `Facilities`
WHERE `status` = 'maintenance'
SELECT COUNT(*) AS `numrows` FROM `Facilities`